# InsertImagePopupSeparator

## Description
Inserts a separator with the specified label at the end of the image popup list.

```pascal
FUNCTION InsertImagePopupSeparator(
				liDialogID    : LONGINT;
				liComponentID : LONGINT;
				strLabel      : STRING): INTEGER;
```

```python
def vs.InsertImagePopupSeparator(liDialogID, liComponentID, strLabel):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|liDialogID|LONGINT|   |
|liComponentID|LONGINT|   |
|strLabel|STRING|   |

## Version
Availability: from VectorWorks12.0

## Category
* Dialogs - Modern